app/views/classificas/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]
---
  <div class="col s10 offset-s1 m6 offset-m3 card <%= @colore %> card-content white-text">
      <% @user = User.find_by(id: classifica.user_id) %>