app/controllers/bet_puntates_controller.rb

SELECT "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."n_giornata" = ? AND "bet_puntates"."user_id" IN (SELECT DISTINCT "users"."id" FROM "users")  ORDER BY user_id ASC  [["n_giornata", 22]]
SELECT  "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."user_id" = ? LIMIT 1  [["user_id", 1]]
---
  def schedine
    @classifica = Classifica.order('punteggio DESC')
    @settimana = BetPuntate.order('n_giornata DESC', 'user_id ASC')
    @utente = User.all
    if !@settimana[0].nil?
      @schedine = BetPuntate.where(n_giornata: @settimana[0].n_giornata, user_id: User.distinct).order('user_id ASC')
    else
      @schedine = BetPuntate.where(user_id: User.distinct).order('user_id ASC')

SELECT "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."user_id" = ? AND "bet_puntates"."n_giornata" = ?  [["user_id", 2], ["n_giornata", 22]]
SELECT COUNT(*) FROM "bet_puntates" WHERE "bet_puntates"."user_id" = ? AND "bet_puntates"."n_giornata" = ?  [["user_id", 2], ["n_giornata", 22]]
---
  def index
    $schedina = nil
    @chiusura = false
    @quota_totale = 1
    @controlla_chiusura = BetPuntate.where(:user_id => current_user.id, n_giornata: @ngiornata[0].n_giornata)
    if @controlla_chiusura.count > 0

SELECT  "bets".* FROM "bets" WHERE "bets"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."bet_id" = ? AND "bet_puntates"."user_id" = ?  [["bet_id", 1], ["user_id", 2]]
SELECT "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."user_id" = ?  ORDER BY n_giornata DESC  [["user_id", 1]]
SELECT "bets".* FROM "bets"  ORDER BY n_giornata DESC
SELECT COUNT(*) FROM "bet_puntates" WHERE "bet_puntates"."bet_id" = ? AND "bet_puntates"."user_id" = ?  [["bet_id", 1], ["user_id", 1]]
INSERT INTO "bet_puntates" ("user_id", "bet_id", "evento_scommesso", "n_giornata", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["bet_id", 1], ["evento_scommesso", "v"], ["n_giornata", 22], ["created_at", "2017-04-26 12:30:26.692407"], ["updated_at", "2017-04-26 12:30:26.692407"]]
---
  def create
    @evento_scelto = Bet.find(params[:bet])
    @controllo = BetPuntate.where(bet_id: params[:bet], user_id: params[:c_u])
    if (@controllo.count == 0) && (!@evento_scelto.chiudi_concorso)
      @controllo_scommessa_piazzata = BetPuntate.where(user_id: params[:c_u]).order('n_giornata DESC')
      @bet_puntate = BetPuntate.new
      @bet_puntate.user_id = params[:c_u]
      @bet_puntate.bet_id = params[:bet]
      @bet_puntate.evento_scommesso = params[:evento_scommesso]
      @ngiornata = Bet.order('n_giornata DESC')
      if !@controllo_scommessa_piazzata[0].nil?
        if (@ngiornata[0].n_giornata == @controllo_scommessa_piazzata[0].n_giornata)
          if (!@controllo_scommessa_piazzata[0].chiusura?)
            @csp = true
          else
            @csp = false
          end
        end
      else
          @csp = false
      end
      if !@controllo_scommessa_piazzata[0].nil?
        if (!@controllo_scommessa_piazzata[0].chiusura?)
          if @ngiornata[0].n_giornata == @controllo_scommessa_piazzata[0].n_giornata
            if (!@ngiornata[0].chiudi_concorso) && (!@controllo_scommessa_piazzata[0].nil?)
              @bet_puntate.n_giornata = @ngiornata[0].n_giornata
              respond_to do |format|
                if @bet_puntate.save

SELECT  "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."user_id" = ? LIMIT 1  [["user_id", 2]]
UPDATE "bet_puntates" SET "chiusura" = 'true' WHERE "bet_puntates"."user_id" = ?  [["user_id", 2]]
---
  def update
    respond_to do |format|
          if BetPuntate.where(:user_id => bet_puntate_params[:user_id]).update_all(chiusura: 'true')

DELETE FROM "bet_puntates" WHERE "bet_puntates"."id" = ?  [["id", 1]]
---
  def destroy
    @bet_puntate.destroy(params[:id])

SELECT  "bet_puntates".* FROM "bet_puntates" WHERE (id= 1) AND "bet_puntates"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bets".* FROM "bets"  ORDER BY n_giornata DESC
---
    def set_bet_puntate
      #@bet_puntates = BetPuntate.where("created_at", params[:bet_data])
      if action_name != 'destroy'
        @bet_puntates = BetPuntate.where("user_id = #{current_user.id}")
      else
        @bet_puntates = BetPuntate.where("id= #{params[:id]}")
        @bet_puntate = BetPuntate.where("id= #{params[:id]}")
      end
      @ngiornata = Bet.order('n_giornata DESC')