app/controllers/bets_controller.rb

  def index
    @appoggio = Bet.order('n_giornata DESC').limit(10)
---
SELECT  "bets".* FROM "bets"  ORDER BY n_giornata DESC LIMIT 10 OFFSET 0

  def create
    @bet = current_user.bets.build(bet_params)
    respond_to do |format|
      if @bet.save
---
INSERT INTO "bets" ("evento", "vittoria", "pareggio", "sconfitta", "logo_in_file_name", "logo_in_content_type", "logo_in_file_size", "logo_in_updated_at", "logo_out_file_name", "logo_out_content_type", "logo_out_file_size", "logo_out_updated_at", "n_giornata", "data", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if bet_params[:chiudi_concorso] == "true"
        @appoggio = Bet.find_by(id: bet_params[:id])
        #@appoggio.each do |appo|
          if @appoggio.update(bet_params)
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "bets" SET "chiudi_concorso" = ?, "risultato" = ?, "updated_at" = ? WHERE "bets"."id" = ?  [["chiudi_concorso", "t"], ["risultato", "v"], ["updated_at", "2017-04-27 10:20:55.741412"], ["id", 1]]

    def set_bet

debugger

      @bet = Bet.find_by(id: params[:id])
      @bet_puntate = BetPuntate.find_by(id: params[:id])
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "bet_puntates".* FROM "bet_puntates" WHERE "bet_puntates"."id" = ? LIMIT 1  [["id", 1]]