app/controllers/classificas_controller.rb

  def index
    @ngiornata = Classifica.order('created_at DESC')

    if @ngiornata.count != 0
      @classificas = Classifica.where(n_giornata: @ngiornata[0].n_giornata).order('punteggio DESC')
    else
      @classificas = Classifica.all
---
SELECT "classificas".* FROM "classificas"  ORDER BY created_at DESC
SELECT COUNT(*) FROM "classificas"
SELECT "classificas".* FROM "classificas" WHERE "classificas"."n_giornata" = ?  ORDER BY punteggio DESC  [["n_giornata", 22]]
SELECT "classificas".* FROM "classificas"

  def create
    aggiorna_classifica
    @classifica = Classifica.last
---
SELECT  "classificas".* FROM "classificas"  ORDER BY "classificas"."id" DESC LIMIT 1

    def set_classifica
      @classifica = Classifica.find(params[:id])
---
SELECT  "classificas".* FROM "classificas" WHERE "classificas"."id" = ? LIMIT 1  [["id", 2]]