app/controllers/eurekas_controller.rb

  def bilancio_edit
    #@bilancio = Eureka.first
    @bilancio = Eureka.find_by(id: params[:format])
---
SELECT  "eurekas".* FROM "eurekas" WHERE "eurekas"."id" = ? LIMIT 1  [["id", 1]]

  def bilancio
    @bilancio = Eureka.all.order('id DESC').limit(10)
    @vincita_spesa = 0
    @bilancio.each do |bil|
      if !bil.vincita.nil?
        @vincita_spesa = @vincita_spesa + bil.vincita - bil.puntata11 - bil.puntata1x - bil.puntatax - bil.puntata2
      else
        @vincita_spesa = @vincita_spesa - bil.puntata11 - bil.puntata1x - bil.puntatax - bil.puntata2
      end
    end
    if !current_user.nil?
      if current_user.admin?
        @bilancio = Eureka.all.order('id DESC').paginate(:page => params[:page], :per_page => 10)
---
SELECT  "eurekas".* FROM "eurekas"  ORDER BY id DESC LIMIT 10 OFFSET 0
SELECT  "eurekas".* FROM "eurekas"  ORDER BY "eurekas"."id" DESC LIMIT 2
SELECT COUNT(*) FROM "eurekas"

  def index
    #@eurekas = Eureka.all

    if !current_user.nil?
      if current_user.admin?
        @eurekas = Eureka.all.order('id DESC').paginate(:page => params[:page], :per_page => 1)
---
SELECT  "eurekas".* FROM "eurekas"  ORDER BY "eurekas"."id" DESC LIMIT 2
SELECT COUNT(*) FROM "eurekas"

  def create
    @eureka = Eureka.new(eureka_params)
    respond_to do |format|
      if @eureka.save
---
INSERT INTO "eurekas" ("evento1", "evento2", "unouno", "unox", "x", "due", "puntata11", "puntata1x", "puntatax", "puntata2", "data", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @eureka.update(eureka_params)
---
UPDATE "eurekas" SET "vincita" = ?, "updated_at" = ? WHERE "eurekas"."id" = ?  [["vincita", 15.5], ["updated_at", "2017-05-05 18:31:32.535179"], ["id", 1]]

    def set_eureka
      @eureka = Eureka.find(params[:id])
---
SELECT  "eurekas".* FROM "eurekas" WHERE "eurekas"."id" = ? LIMIT 1  [["id", 1]]