app/views/bet_puntates/schedine.html.erb

        <% @schedine.each do |schedina| %>
            <% @utente = User.find_by(id:schedina.user_id) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 1]]


                    <% @evento = Bet.find_by(id: schedina.bet_id) %>
---
SELECT  "bets".* FROM "bets" WHERE "bets"."id" = ? LIMIT 1  [["id", 2]]